sendu2wfdx/RemoteBSP/firmware/boards/stm32f072rbt6/main.c
static volatile uint32_t motion_timebase_epochs;
#endif

#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
enum {
    MOTION_SLOT_SOFT_UART_PORTS = 5U,
};

static rbsp_soft_half_duplex_uart_t soft_uart;
/* 未选择 TMC2209 的槽不占用其预留 UART GPIO，也不接受 UART 配置请求。 */
static const bool default_soft_uart_port_present[MOTION_SLOT_SOFT_UART_PORTS] = {
#ifdef CONFIG_MOTION_SLOT0_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
#ifdef CONFIG_MOTION_SLOT1_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
#ifdef CONFIG_MOTION_SLOT2_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
#ifdef CONFIG_MOTION_SLOT3_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
#ifdef CONFIG_MOTION_SLOT4_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
};
static const uint8_t default_soft_uart_gpio_ports[MOTION_SLOT_SOFT_UART_PORTS] = {
#ifdef CONFIG_MOTION_SLOT0_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT0_TMC_UART_PIN / 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT1_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT1_TMC_UART_PIN / 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT2_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT2_TMC_UART_PIN / 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT3_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT3_TMC_UART_PIN / 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT4_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT4_TMC_UART_PIN / 16U,
#else
    0U,
#endif
};
static const uint8_t default_soft_uart_gpio_pins[MOTION_SLOT_SOFT_UART_PORTS] = {
#ifdef CONFIG_MOTION_SLOT0_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT0_TMC_UART_PIN % 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT1_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT1_TMC_UART_PIN % 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT2_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT2_TMC_UART_PIN % 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT3_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT3_TMC_UART_PIN % 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT4_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT4_TMC_UART_PIN % 16U,
#else
    0U,
#endif
};

static bool soft_uart_port_present[MOTION_SLOT_SOFT_UART_PORTS];
static uint8_t soft_uart_gpio_ports[MOTION_SLOT_SOFT_UART_PORTS];
static uint8_t soft_uart_gpio_pins[MOTION_SLOT_SOFT_UART_PORTS];

static void soft_uart_load_default_mapping(void) {
    memcpy(soft_uart_port_present, default_soft_uart_port_present,
           sizeof(soft_uart_port_present));
    memcpy(soft_uart_gpio_ports, default_soft_uart_gpio_ports,
           sizeof(soft_uart_gpio_ports));
    memcpy(soft_uart_gpio_pins, default_soft_uart_gpio_pins,
           sizeof(soft_uart_gpio_pins));
}
#endif

#ifdef RBSP_HARDWARE_UART_ENABLED
static UART_HandleTypeDef uart0_handle;
static rbsp_byte_ring_t uart0_rx_ring;
static rbsp_byte_ring_t uart0_tx_ring;
static uint8_t uart0_rx_storage[CONFIG_UART_RX_BUFFER_SIZE];
static uint8_t uart0_tx_storage[CONFIG_UART_TX_BUFFER_SIZE];
static volatile bool uart0_configured;
#endif

volatile uint32_t rbsp_diag_can_rx_frames;
volatile uint32_t rbsp_diag_can_tx_frames;
volatile uint32_t rbsp_diag_can_tx_failures;
volatile uint32_t rbsp_diag_can_rx_failures;
#ifdef RBSP_HARDWARE_UART_ENABLED
volatile uint32_t rbsp_diag_uart_rx_bytes;
volatile uint32_t rbsp_diag_uart_tx_bytes;
volatile uint32_t rbsp_diag_uart_rx_overflows;
volatile uint32_t rbsp_diag_uart_errors;
#endif

static void put_u32(uint8_t* output, uint32_t value) {
    output[0] = (uint8_t)value;
    output[1] = (uint8_t)(value >> 8U);
    output[2] = (uint8_t)(value >> 16U);
    output[3] = (uint8_t)(value >> 24U);
}

static void fatal_error(void) {
    __disable_irq();
    for (;;) {
    }
}

static void vector_table_relocate(void) {
    const uint32_t* source = (const uint32_t*)(
        FLASH_BASE + CONFIG_APPLICATION_FLASH_OFFSET);
    volatile uint32_t* destination = (volatile uint32_t*)SRAM_BASE;

    __disable_irq();
    for (uint32_t index = 0U; index < F072_VECTOR_WORDS; ++index) {
        destination[index] = source[index];
    }
    __HAL_RCC_SYSCFG_CLK_ENABLE();
    __HAL_SYSCFG_REMAPMEMORY_SRAM();
    __DSB();
    __ISB();
    __enable_irq();
}

#ifdef CONFIG_APP_LAYOUT_KATAPULT_8K
static void board_enter_bootloader(rbsp_bootloader_mode_t mode) {
    static const uint64_t can_request_signature =
        UINT64_C(0x5984E3FA6CA1589B);
    static const uint64_t usb_request_signature =
        UINT64_C(0x8F3D6A21C457B09E);
    const uint64_t request_signature =
        mode == RBSP_BOOTLOADER_USB
            ? usb_request_signature : can_request_signature;
    const uint32_t signature_address =
        *(const volatile uint32_t*)FLASH_BASE;
    const uint32_t ram_end = SRAM_BASE + F072_SRAM_SIZE;

    if ((signature_address & 7U) != 0U ||
        signature_address < SRAM_BASE ||
        signature_address > ram_end - sizeof(request_signature)) {
        fatal_error();
    }
    __disable_irq();
    *(volatile uint64_t*)(uintptr_t)signature_address =
        request_signature;
    __DSB();
    __ISB();
    NVIC_SystemReset();
    for (;;) {
    }
}
#endif

static void system_clock_configure(void) {
    RCC_OscInitTypeDef oscillator = {0};
    RCC_ClkInitTypeDef clock = {0};

#ifdef CONFIG_F072_CLOCK_HSE_8MHZ
    /* 五槽默认映射使用 8MHz 晶振，经 PLL x6 得到精确的 48MHz CAN 时钟。 */
    oscillator.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    oscillator.HSEState = RCC_HSE_ON;
    oscillator.PLL.PLLState = RCC_PLL_ON;
    oscillator.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    oscillator.PLL.PREDIV = RCC_PREDIV_DIV1;
    oscillator.PLL.PLLMUL = RCC_PLL_MUL6;
#else
    /* 通用 F072 板卡使用经工厂校准的 HSI48，直接作为 SYSCLK。 */
    oscillator.OscillatorType = RCC_OSCILLATORTYPE_HSI48;
    oscillator.HSI48State = RCC_HSI48_ON;
    oscillator.PLL.PLLState = RCC_PLL_NONE;
#endif
    if (HAL_RCC_OscConfig(&oscillator) != HAL_OK) {
        fatal_error();
    }

    clock.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                      RCC_CLOCKTYPE_PCLK1;
    clock.SYSCLKSource =
#ifdef CONFIG_F072_CLOCK_HSE_8MHZ
        RCC_SYSCLKSOURCE_PLLCLK;
#else
        RCC_SYSCLKSOURCE_HSI48;
#endif
    clock.AHBCLKDivider = RCC_SYSCLK_DIV1;
    clock.APB1CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&clock, FLASH_LATENCY_1) != HAL_OK) {
        fatal_error();
    }

    SystemCoreClockUpdate();
    if (SystemCoreClock != CONFIG_SYSTEM_CLOCK_HZ ||
        HAL_RCC_GetPCLK1Freq() != 48000000U) {
        fatal_error();
    }
}

static GPIO_TypeDef* gpio_port_from_index(uint8_t index) {
    switch (index) {
        case 0U:
            return GPIOA;
        case 1U:
            return GPIOB;
        case 2U:
            return GPIOC;
        case 3U:
            return GPIOD;
        default:
            return NULL;
    }
}

