sendu2wfdx/RemoteBSP/firmware/boards/stm32f072rbt6/main.c
static bool board_gpio_configure_pull(uint16_t encoded_pin,
                                      rbsp_gpio_direction_t direction,
                                      rbsp_gpio_pull_t pull,
                                      bool initial_value) {
    if (!gpio_pin_allowed(encoded_pin) || pull > RBSP_GPIO_PULL_DOWN) {
        return false;
    }
    const uint8_t port_index = (uint8_t)(encoded_pin / 16U);
    const uint8_t pin_index = (uint8_t)(encoded_pin % 16U);
    GPIO_TypeDef* port = gpio_port_from_index(port_index);
    enable_gpio_clock(port_index);

    if (direction == RBSP_GPIO_OUTPUT) {
        HAL_GPIO_WritePin(port, (uint16_t)(1U << pin_index),
                          initial_value ? GPIO_PIN_SET : GPIO_PIN_RESET);
    }
    GPIO_InitTypeDef init = {0};
    init.Pin = (uint16_t)(1U << pin_index);
    init.Mode = direction == RBSP_GPIO_OUTPUT
                    ? GPIO_MODE_OUTPUT_PP
                    : GPIO_MODE_INPUT;
    init.Pull = pull == RBSP_GPIO_PULL_UP
                    ? GPIO_PULLUP
                    : (pull == RBSP_GPIO_PULL_DOWN ? GPIO_PULLDOWN
                                                   : GPIO_NOPULL);
    /*
     * PC13..PC15 由备份域电源开关供电，数据手册限制为最高 2MHz，
     * 因此即使作为普通输出也只选择低速档。
     */
    init.Speed = (port_index == 2U && pin_index >= 13U)
                     ? GPIO_SPEED_FREQ_LOW
                     : GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(port, &init);
    return true;
}

#ifdef CONFIG_REMOTEBSP_STATIC_GPIO_MAP
static bool board_gpio_resource_allowed(
    uint16_t pin, rbsp_gpio_direction_t direction) {
    rbsp_startup_gpio_mode_t mode;
#ifdef RBSP_STUDIO_STATIC_RESOURCE_TABLE
    if (!rbsp_startup_gpio_find_table(
            rbsp_studio_gpio_resources, RBSP_STUDIO_GPIO_RESOURCE_COUNT,
            pin, &mode)) {
#else
    if (!rbsp_startup_gpio_find(
            CONFIG_STARTUP_GPIO_OUTPUT_LOW,
            CONFIG_STARTUP_GPIO_OUTPUT_HIGH,
            CONFIG_STARTUP_GPIO_INPUT_FLOATING,
            CONFIG_STARTUP_GPIO_INPUT_PULLUP,
            CONFIG_STARTUP_GPIO_INPUT_PULLDOWN, pin, &mode)) {
#endif
        return false;
    }
    return direction == RBSP_GPIO_OUTPUT
        ? mode == RBSP_STARTUP_GPIO_OUTPUT_LOW ||
              mode == RBSP_STARTUP_GPIO_OUTPUT_HIGH
        : mode == RBSP_STARTUP_GPIO_INPUT_FLOATING ||
              mode == RBSP_STARTUP_GPIO_INPUT_PULLUP ||
              mode == RBSP_STARTUP_GPIO_INPUT_PULLDOWN;
}
#endif

static bool board_gpio_configure(uint16_t encoded_pin,
                                 rbsp_gpio_direction_t direction,
                                 bool initial_value) {
    return board_gpio_configure_pull(encoded_pin, direction,
                                     RBSP_GPIO_FLOATING, initial_value);
}

static bool board_gpio_write(uint16_t encoded_pin, bool value) {
    if (!gpio_pin_allowed(encoded_pin)) {
        return false;
    }
    GPIO_TypeDef* port =
        gpio_port_from_index((uint8_t)(encoded_pin / 16U));
    HAL_GPIO_WritePin(
        port, (uint16_t)(1U << (encoded_pin % 16U)),
        value ? GPIO_PIN_SET : GPIO_PIN_RESET);
    return true;
}

static bool board_gpio_read(uint16_t encoded_pin, bool* value) {
    if (!gpio_pin_allowed(encoded_pin) || value == NULL) {
        return false;
    }
    GPIO_TypeDef* port =
        gpio_port_from_index((uint8_t)(encoded_pin / 16U));
    *value = HAL_GPIO_ReadPin(
                 port, (uint16_t)(1U << (encoded_pin % 16U))) ==
             GPIO_PIN_SET;
    return true;
}

static uint64_t board_monotonic_microseconds(void) {
    static uint32_t previous_ms;
    static uint64_t epoch_ms;
    const uint32_t now_ms = HAL_GetTick();
    if (now_ms < previous_ms) epoch_ms += UINT64_C(1) << 32U;
    previous_ms = now_ms;
    return (epoch_ms + now_ms) * UINT64_C(1000);
}

#ifdef CONFIG_REMOTEBSP_MOTION
static void motion_write_pin(motion_pin_t pin, bool high) {
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    const uint16_t mask = (uint16_t)(1U << pin.pin);
    gpio->BSRR = high ? mask : (uint32_t)mask << 16U;
}

static void motion_configure_output(motion_pin_t pin, bool initial_high) {
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    const uint16_t mask = (uint16_t)(1U << pin.pin);
    enable_gpio_clock(pin.port);
    motion_write_pin(pin, initial_high);
    GPIO_InitTypeDef init = {0};
    init.Pin = mask;
    init.Mode = GPIO_MODE_OUTPUT_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = (pin.port == 2U && pin.pin >= 13U)
                     ? GPIO_SPEED_FREQ_LOW
                     : GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(gpio, &init);
}

static motion_pin_t motion_decode_pin(uint16_t encoded_pin) {
    const motion_pin_t pin = {
        (uint8_t)(encoded_pin / 16U), (uint8_t)(encoded_pin % 16U)};
    return pin;
}

static void motion_configure_limit_input(motion_pin_t pin,
                                         bool active_low) {
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    enable_gpio_clock(pin.port);
    GPIO_InitTypeDef init = {0};
    init.Pin = (uint16_t)(1U << pin.pin);
    init.Mode = GPIO_MODE_INPUT;
    init.Pull = active_low ? GPIO_PULLUP : GPIO_PULLDOWN;
    init.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(gpio, &init);
}

static void motion_load_default_mapping(void) {
    memset(active_motion_axes, 0, sizeof(active_motion_axes));
    active_motion_axis_count = MOTION_SLOT_AXIS_COUNT;
    for (uint8_t axis = 0U; axis < MOTION_SLOT_AXIS_COUNT; ++axis) {
        const motion_axis_pins_t* const source = &motion_axis_pins[axis];
        rbsp_runtime_motion_axis_config_t* const destination =
            &active_motion_axes[axis];
        destination->logical_id = 0x09000000UL + axis;
        destination->maximum_step_rate_hz =
            CONFIG_MOTION_MAX_STEP_RATE_HZ;
        destination->step_pin = (uint16_t)(
            source->step.port * 16U + source->step.pin);
        destination->direction_pin = (uint16_t)(
            source->direction.port * 16U + source->direction.pin);
        destination->enable_pin = (uint16_t)(
            source->enable.port * 16U + source->enable.pin);
        destination->enable_present = true;
        destination->direction_inverted = source->direction_inverted;
        destination->enable_active_low = source->enable_active_low;
        destination->limit_pin = UINT16_MAX;
#ifdef CONFIG_MOTION_SLOT_LIMIT_INPUTS
        if (motion_limit_pins[axis].present) {
            destination->limit_pin = (uint16_t)(
                motion_limit_pins[axis].pin.port * 16U +
                motion_limit_pins[axis].pin.pin);
            destination->limit_active_low = true;
        }
#endif
        active_motion_enable_group_ids[axis] =
            motion_enable_group_ids[axis];
    }
}

static void motion_apply_active_mapping(void) {
    memset(motion_enable_requests, 0, sizeof(motion_enable_requests));
    for (uint8_t axis = 0U; axis < active_motion_axis_count; ++axis) {
        const rbsp_runtime_motion_axis_config_t* const config =
            &active_motion_axes[axis];
        if (config->enable_present) {
            motion_configure_output(
                motion_decode_pin(config->enable_pin),
                config->enable_active_low);
            active_motion_enable_group_ids[axis] = config->enable_pin;
        } else {
            active_motion_enable_group_ids[axis] = UINT16_MAX;
        }
        motion_configure_output(motion_decode_pin(config->step_pin), false);
        motion_configure_output(
            motion_decode_pin(config->direction_pin),
            config->direction_inverted);
        if (config->limit_pin != UINT16_MAX) {
            motion_configure_limit_input(
                motion_decode_pin(config->limit_pin),
                config->limit_active_low);
        }
    }
}


