sendu2wfdx/RemoteBSP/firmware/boards/stm32f072rbt6/main.c
/*
 * 运动引脚不依赖运行时 GPIO 对象。上电即先禁用所有驱动器，再固定为推挽输出，
 * 避免资源创建失败或主循环阻塞时产生悬空 STEP 脉冲。
 */
static void motion_outputs_configure(void) {
    motion_load_default_mapping();
    motion_apply_active_mapping();
}

static bool board_motion_set_enable(uint8_t axis, bool enabled) {
    if (axis >= active_motion_axis_count) {
        return false;
    }
    const rbsp_runtime_motion_axis_config_t* const config =
        &active_motion_axes[axis];
    if (!config->enable_present) {
        return true;
    }
    bool group_enabled = false;
    if (!rbsp_motion_shared_enable_update(
            active_motion_enable_group_ids, motion_enable_requests,
            active_motion_axis_count, axis, enabled, &group_enabled)) {
        return false;
    }
    motion_write_pin(motion_decode_pin(config->enable_pin),
                     group_enabled != config->enable_active_low);
    return true;
}

static bool board_motion_set_direction(uint8_t axis, bool positive) {
    if (axis >= active_motion_axis_count) {
        return false;
    }
    const rbsp_runtime_motion_axis_config_t* const config =
        &active_motion_axes[axis];
    motion_write_pin(motion_decode_pin(config->direction_pin),
                     positive != config->direction_inverted);
    return true;
}

static bool board_motion_set_step(uint8_t axis, bool high) {
    if (axis >= active_motion_axis_count) {
        return false;
    }
    motion_write_pin(
        motion_decode_pin(active_motion_axes[axis].step_pin), high);
    return true;
}

static bool board_motion_limit_active(uint8_t axis, bool* active) {
    if (axis >= active_motion_axis_count || active == NULL) {
        return false;
    }
    const rbsp_runtime_motion_axis_config_t* const config =
        &active_motion_axes[axis];
    if (config->limit_pin == UINT16_MAX) {
        *active = false;
        return true;
    }
    const motion_pin_t pin = motion_decode_pin(config->limit_pin);
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    const bool high = (gpio->IDR & (uint16_t)(1U << pin.pin)) != 0U;
    *active = config->limit_active_low ? !high : high;
    return true;
}

/* TIM2 以 1MHz 自由运行，配合溢出计数形成单调 64 位运动时钟。 */
static void motion_timebase_configure(void) {
    __HAL_RCC_TIM2_CLK_ENABLE();
    TIM2->CR1 = 0U;
    TIM2->PSC = 47U;
    TIM2->ARR = UINT32_MAX;
    TIM2->EGR = TIM_EGR_UG;
    TIM2->CNT = 0U;
    TIM2->SR = 0U;
    TIM2->DIER = TIM_DIER_UIE;
    motion_timebase_epochs = 0U;
    HAL_NVIC_SetPriority(TIM2_IRQn, 0U, 0U);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
    TIM2->CR1 = TIM_CR1_CEN;
}

static uint64_t board_motion_nanoseconds(void) {
    uint32_t before;
    uint32_t after;
    uint32_t counter;
    do {
        before = motion_timebase_epochs;
        counter = TIM2->CNT;
        after = motion_timebase_epochs;
    } while (before != after);
    if ((TIM2->SR & TIM_SR_UIF) != 0U && counter < UINT32_C(0x80000000)) {
        ++after;
    }
    return (((uint64_t)after << 32U) | counter) * 1000ULL;
}

/* TIM2_CH1 只在下一条运动边沿到期时触发，不再占用周期定时器。 */
static bool motion_schedule_compare(uint64_t deadline_ns) {
    uint64_t deadline_us = deadline_ns / 1000ULL;
    if ((deadline_ns % 1000ULL) != 0U && deadline_us != UINT64_MAX) {
        ++deadline_us;
    }
    const uint64_t now_us = board_motion_nanoseconds() / 1000ULL;
    uint64_t delta_us = deadline_us > now_us
                            ? deadline_us - now_us
                            : 0U;
    if (delta_us < CONFIG_MOTION_COMPARE_MIN_LEAD_US) {
        delta_us = CONFIG_MOTION_COMPARE_MIN_LEAD_US;
    }
    if (delta_us > INT32_MAX) {
        delta_us = INT32_MAX;
    }

    TIM2->DIER &= ~TIM_DIER_CC1IE;
    uint32_t target = TIM2->CNT + (uint32_t)delta_us;
    TIM2->CCR1 = target;
    TIM2->SR = ~TIM_SR_CC1IF;
    if ((int32_t)(target - TIM2->CNT) <
        (int32_t)CONFIG_MOTION_COMPARE_MIN_LEAD_US) {
        target = TIM2->CNT + CONFIG_MOTION_COMPARE_MIN_LEAD_US;
        TIM2->CCR1 = target;
        TIM2->SR = ~TIM_SR_CC1IF;
    }
    TIM2->DIER |= TIM_DIER_CC1IE;
    return true;
}

static void motion_cancel_compare(void) {
    TIM2->DIER &= ~TIM_DIER_CC1IE;
    TIM2->SR = ~TIM_SR_CC1IF;
}

static uint32_t motion_enter_critical(void) {
    const uint32_t state = __get_PRIMASK();
    __disable_irq();
    __DMB();
    return state;
}

static void motion_exit_critical(uint32_t state) {
    __DMB();
    if (state == 0U) {
        __enable_irq();
    }
}
#endif

#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
/* TIM17 以 48MHz 自由运行，为软串口提供独立于 SysTick 的周期级时基。 */
static void soft_uart_timer_configure(void) {
    __HAL_RCC_TIM17_CLK_ENABLE();
    TIM17->CR1 = 0U;
    TIM17->PSC = 0U;
    TIM17->ARR = UINT16_MAX;
    TIM17->EGR = TIM_EGR_UG;
    TIM17->CNT = 0U;
    TIM17->CR1 = TIM_CR1_CEN;
}

static GPIO_TypeDef* soft_uart_gpio_port(uint8_t port) {
    return port < CONFIG_SOFT_HALF_DUPLEX_UART_PORT_COUNT &&
                   port < MOTION_SLOT_SOFT_UART_PORTS &&
                   soft_uart_port_present[port]
               ? gpio_port_from_index(soft_uart_gpio_ports[port])
               : NULL;
}

static uint16_t soft_uart_gpio_mask(uint8_t port) {
    return port < CONFIG_SOFT_HALF_DUPLEX_UART_PORT_COUNT &&
                   port < MOTION_SLOT_SOFT_UART_PORTS &&
                   soft_uart_port_present[port]
               ? (uint16_t)(1U << soft_uart_gpio_pins[port])
               : 0U;
}

static bool soft_uart_port_prepare(void* context, uint8_t port) {
    (void)context;
    if (soft_uart_gpio_port(port) == NULL ||
        soft_uart_gpio_mask(port) == 0U) {
        return false;
    }
    enable_gpio_clock(soft_uart_gpio_ports[port]);
    return true;
}

static bool soft_uart_set_output(void* context, uint8_t port, bool high) {
    (void)context;
    GPIO_TypeDef* gpio = soft_uart_gpio_port(port);
    const uint16_t mask = soft_uart_gpio_mask(port);
    if (gpio == NULL || mask == 0U) {
        return false;
    }
    gpio->BSRR = high ? mask : (uint32_t)mask << 16U;
    GPIO_InitTypeDef init = {0};
    init.Pin = mask;
    init.Mode = GPIO_MODE_OUTPUT_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = (soft_uart_gpio_ports[port] == 2U &&
                  soft_uart_gpio_pins[port] >= 13U)
                     ? GPIO_SPEED_FREQ_LOW
                     : GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(gpio, &init);
    return true;
}

static bool soft_uart_set_input(void* context, uint8_t port) {
    (void)context;
    GPIO_TypeDef* gpio = soft_uart_gpio_port(port);
    const uint16_t mask = soft_uart_gpio_mask(port);
    if (gpio == NULL || mask == 0U) {
        return false;
    }
    GPIO_InitTypeDef init = {0};
    init.Pin = mask;
    init.Mode = GPIO_MODE_INPUT;
    init.Pull = GPIO_PULLUP;
    init.Speed = (soft_uart_gpio_ports[port] == 2U &&
                  soft_uart_gpio_pins[port] >= 13U)
                     ? GPIO_SPEED_FREQ_LOW
                     : GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(gpio, &init);
    return true;
}

