sendu2wfdx/RemoteBSP/firmware/boards/stm32f072rbt6/main.c
static bool board_uart_write(uint8_t port, const uint8_t* data,
                             size_t length) {
#ifdef RBSP_HARDWARE_UART_ENABLED
    if (port < CONFIG_HARDWARE_UART_RESOURCE_COUNT) {
        return board_hardware_uart_write(port, data, length);
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    return board_soft_uart_write(
        (uint8_t)(port - CONFIG_TMC2209_UART_OBJECT_BASE),
        data, length);
#endif
    return false;
}

static bool board_uart_reset(uint8_t port) {
#ifdef RBSP_HARDWARE_UART_ENABLED
    if (port < CONFIG_HARDWARE_UART_RESOURCE_COUNT) {
        board_hardware_uart_stop();
        return true;
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    return rbsp_soft_half_duplex_uart_reset(
        &soft_uart,
        (uint8_t)(port - CONFIG_TMC2209_UART_OBJECT_BASE));
#else
    return false;
#endif
}
#endif

static void can_configure(void) {
    can_handle.Instance = CAN;
    can_handle.Init.Prescaler = CAN_PRESCALER;
    can_handle.Init.Mode = CAN_MODE_NORMAL;
    can_handle.Init.SyncJumpWidth = CAN_SJW_1TQ;
    can_handle.Init.TimeSeg1 = CAN_BS1_13TQ;
    can_handle.Init.TimeSeg2 = CAN_BS2_2TQ;
    can_handle.Init.TimeTriggeredMode = DISABLE;
    can_handle.Init.AutoBusOff = ENABLE;
    can_handle.Init.AutoWakeUp = DISABLE;
    can_handle.Init.AutoRetransmission = ENABLE;
    can_handle.Init.ReceiveFifoLocked = DISABLE;
    can_handle.Init.TransmitFifoPriority = ENABLE;
    if (HAL_CAN_Init(&can_handle) != HAL_OK) {
        fatal_error();
    }

    CAN_FilterTypeDef filter = {0};
    filter.FilterBank = 0U;
    filter.FilterMode = CAN_FILTERMODE_IDMASK;
    filter.FilterScale = CAN_FILTERSCALE_32BIT;
    filter.FilterFIFOAssignment = CAN_RX_FIFO0;
    filter.FilterActivation = ENABLE;
    if (HAL_CAN_ConfigFilter(&can_handle, &filter) != HAL_OK ||
        HAL_CAN_Start(&can_handle) != HAL_OK) {
        fatal_error();
    }
}

static bool board_can_send(const rbsp_can_frame_t* frame) {
    if (frame == NULL || frame->length > 8U ||
        frame->identifier > 0x7FFU) {
        return false;
    }
    const uint32_t started = HAL_GetTick();
    while (HAL_CAN_GetTxMailboxesFreeLevel(&can_handle) == 0U) {
        if ((uint32_t)(HAL_GetTick() - started) >= 20U) {
            ++rbsp_diag_can_tx_failures;
            return false;
        }
    }
    CAN_TxHeaderTypeDef header = {0};
    uint32_t mailbox = 0U;
    header.StdId = frame->identifier;
    header.IDE = CAN_ID_STD;
    header.RTR = CAN_RTR_DATA;
    header.DLC = frame->length;
    header.TransmitGlobalTime = DISABLE;
    if (HAL_CAN_AddTxMessage(&can_handle, &header,
                             (uint8_t*)frame->data,
                             &mailbox) != HAL_OK) {
        ++rbsp_diag_can_tx_failures;
        return false;
    }
    ++rbsp_diag_can_tx_frames;
    return true;
}

static void receive_can_frames(void) {
    while (HAL_CAN_GetRxFifoFillLevel(&can_handle, CAN_RX_FIFO0) != 0U) {
        CAN_RxHeaderTypeDef header = {0};
        rbsp_can_frame_t frame = {0};
        if (HAL_CAN_GetRxMessage(&can_handle, CAN_RX_FIFO0, &header,
                                 frame.data) != HAL_OK) {
            ++rbsp_diag_can_rx_failures;
            return;
        }
        if (header.IDE != CAN_ID_STD || header.RTR != CAN_RTR_DATA ||
            header.DLC > 8U) {
            continue;
        }
        ++rbsp_diag_can_rx_frames;
        frame.identifier = header.StdId;
        frame.length = (uint8_t)header.DLC;
        rbsp_core_accept_can(&remote_core, &frame);
    }
}

static void make_node_info(rbsp_node_info_t* info) {
    memset(info, 0, sizeof(*info));
    put_u32(info->uuid + 0U, HAL_GetUIDw0());
    put_u32(info->uuid + 4U, HAL_GetUIDw1());
    put_u32(info->uuid + 8U, HAL_GetUIDw2());
    put_u32(info->uuid + 12U, CONFIG_BOARD_TYPE);
    info->firmware_major = CONFIG_FIRMWARE_VERSION_MAJOR;
    info->firmware_minor = CONFIG_FIRMWARE_VERSION_MINOR;
    info->firmware_patch = CONFIG_FIRMWARE_VERSION_PATCH;
    info->board_type = CONFIG_BOARD_TYPE;
}

int main(void) {
    vector_table_relocate();
    HAL_Init();
    system_clock_configure();
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    soft_uart_load_default_mapping();
#endif
#if defined(CONFIG_REMOTEBSP_MOTION) || \
    defined(CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART)
    if (!motion_slot_configuration_valid()) {
        fatal_error();
    }
#endif
    startup_gpio_configure();
#ifdef CONFIG_REMOTEBSP_BUS
    if (!rbsp_f072_bus_init()) {
        fatal_error();
    }
#endif
#if defined(CONFIG_REMOTEBSP_PWM) || defined(CONFIG_REMOTEBSP_TIMED_BITSTREAM)
    if (!rbsp_board_waveform_init()) {
        fatal_error();
    }
#endif
#ifdef CONFIG_REMOTEBSP_MOTION
    motion_outputs_configure();
    motion_timebase_configure();
#endif
    transceiver_enable();
    can_configure();
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    soft_uart_timer_configure();
    const rbsp_soft_half_duplex_uart_hal_t soft_uart_hal = {
        .context = NULL,
        .port_prepare = soft_uart_port_prepare,
        .set_output = soft_uart_set_output,
        .set_input = soft_uart_set_input,
        .read_input = soft_uart_read_input,
        .timing_hz = CONFIG_SYSTEM_CLOCK_HZ,
        .delay_ticks = soft_uart_delay_ticks,
        .irq_save_disable = soft_uart_irq_save_disable,
        .irq_restore = soft_uart_irq_restore,
    };
    if (!rbsp_soft_half_duplex_uart_init(&soft_uart, &soft_uart_hal)) {
        fatal_error();
    }
#endif
#ifdef RBSP_HARDWARE_UART_ENABLED
    if (!rbsp_byte_ring_init(&uart0_rx_ring, uart0_rx_storage,
                             sizeof(uart0_rx_storage)) ||
        !rbsp_byte_ring_init(&uart0_tx_ring, uart0_tx_storage,
                             sizeof(uart0_tx_storage))) {
        fatal_error();
    }
#endif

    (void)rbsp_stm32_health_init();
#ifdef CONFIG_REMOTEBSP_MOTION
    if (!rbsp_stm32_motion_epoch_init()) { fatal_error(); }
#endif
    rbsp_node_info_t info;
    make_node_info(&info);
    const rbsp_hal_t hal = {
        .can_send = board_can_send,
        .milliseconds = HAL_GetTick,
        .health_sample = rbsp_stm32_health_sample,
#ifdef CONFIG_REMOTEBSP_MOTION
        .motion_boot_epoch = rbsp_stm32_motion_boot_epoch,
#endif
        .microseconds = board_monotonic_microseconds,
        .gpio_configure = board_gpio_configure,
        .gpio_configure_pull = board_gpio_configure_pull,
        .gpio_write = board_gpio_write,
        .gpio_read = board_gpio_read,
#ifdef CONFIG_REMOTEBSP_BUS
        .bus_resources = rbsp_f072_bus_resources(),
        .bus_resource_count = rbsp_f072_bus_resource_count(),
        .i2c_transfer = rbsp_f072_i2c_transfer,
        .spi_transfer = rbsp_f072_spi_transfer,
        .resource_status = rbsp_f072_bus_resource_status,
#endif
#ifdef CONFIG_REMOTEBSP_STATIC_GPIO_MAP
        .gpio_resource_allowed = board_gpio_resource_allowed,
#endif
#if CONFIG_UART_RESOURCE_COUNT > 0
        .uart_configure = board_uart_configure,
        .uart_read = board_uart_read,
        .uart_write = board_uart_write,
        .uart_reset = board_uart_reset,
#endif
#ifdef CONFIG_REMOTEBSP_PWM
        .pwm_configure = rbsp_board_pwm_configure,
        .pwm_write = rbsp_board_pwm_write,
        .pwm_stop = rbsp_board_pwm_stop,
#endif
#ifdef CONFIG_REMOTEBSP_TIMED_BITSTREAM
        .timed_bitstream_configure = rbsp_board_timed_bitstream_configure,
        .timed_bitstream_write = rbsp_board_timed_bitstream_write,
        .timed_bitstream_busy = rbsp_board_timed_bitstream_busy,
        .timed_bitstream_abort = rbsp_board_timed_bitstream_abort,
#endif
#ifdef CONFIG_REMOTEBSP_MOTION
        .nanoseconds = board_motion_nanoseconds,
        .motion_axis_count = MOTION_SLOT_AXIS_COUNT,
        .motion_set_enable = board_motion_set_enable,
        .motion_set_direction = board_motion_set_direction,
        .motion_set_step = board_motion_set_step,
        .motion_schedule_compare = motion_schedule_compare,
        .motion_cancel_compare = motion_cancel_compare,
        .motion_enter_critical = motion_enter_critical,
        .motion_exit_critical = motion_exit_critical,
        .motion_limit_active = board_motion_limit_active,
#endif
#ifdef CONFIG_APP_LAYOUT_KATAPULT_8K
        .enter_bootloader = board_enter_bootloader,
#endif
    };
    if (!rbsp_core_init(&remote_core, &hal, RBSP_CAN_CLASSICAL,
                        &info)) {
        fatal_error();
    }
#ifdef CONFIG_REMOTEBSP_DEVICE_PARAMS
    rbsp_device_param_backend device_param_backend;
    if (!rbsp_device_parameter_backend_init(
            &device_param_backend) ||
        !rbsp_core_device_params_init(
            &remote_core, &device_param_backend)) {
        fatal_error();
    }
#endif
    for (;;) {
        receive_can_frames();
        rbsp_core_poll(&remote_core);
    }
}

