sendu2wfdx/RemoteBSP/firmware/boards/stm32f072rbt6/main.c
void SysTick_Handler(void) {
    HAL_IncTick();
}

#ifdef CONFIG_REMOTEBSP_MOTION
void TIM2_IRQHandler(void) {
    const uint32_t status = TIM2->SR;
    TIM2->SR = ~(status & (TIM_SR_UIF | TIM_SR_CC1IF));
    if ((status & TIM_SR_UIF) != 0U) {
        ++motion_timebase_epochs;
    }
    if ((status & TIM_SR_CC1IF) != 0U) {
        TIM2->DIER &= ~TIM_DIER_CC1IE;
        (void)rbsp_core_motion_service(&remote_core);
    }
}
#endif

#ifdef RBSP_HARDWARE_UART_ENABLED
void USART1_IRQHandler(void) {
    if (!uart0_configured) {
        return;
    }

    const uint32_t status = uart0_handle.Instance->ISR;
    const uint32_t error_flags =
        USART_ISR_ORE | USART_ISR_NE | USART_ISR_FE | USART_ISR_PE;
    if ((status & USART_ISR_RXNE) != 0U) {
        const uint8_t value = (uint8_t)uart0_handle.Instance->RDR;
        if (rbsp_byte_ring_push(&uart0_rx_ring, value)) {
            ++rbsp_diag_uart_rx_bytes;
        } else {
            ++rbsp_diag_uart_rx_overflows;
        }
    }
    if ((status & error_flags) != 0U) {
        uart0_handle.Instance->ICR =
            USART_ICR_ORECF | USART_ICR_NCF |
            USART_ICR_FECF | USART_ICR_PECF;
        ++rbsp_diag_uart_errors;
    }

    if ((uart0_handle.Instance->ISR & USART_ISR_TXE) != 0U &&
        (uart0_handle.Instance->CR1 & USART_CR1_TXEIE) != 0U) {
        uint8_t value;
        if (rbsp_byte_ring_pop(&uart0_tx_ring, &value)) {
            uart0_handle.Instance->TDR = value;
            ++rbsp_diag_uart_tx_bytes;
        } else {
            __HAL_UART_DISABLE_IT(&uart0_handle, UART_IT_TXE);
        }
    }
}
#endif
